Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes
The OpenGraphicObjectAttributes class is the attributes class of the open graphic object.

Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes.Arrowhead
The arrowhead attributes of the open graphic object. The end points of an open graphic object
can contain arrowheads.

Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes.#ctor
Base constructor.

Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes.#ctor(System.String)
Base constructor.

Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes.LoadAttributes(System.String,Tekla.Structures.Drawing.DrawingObject.ObjectTypes)
Loads attributes from attribute file for the specified Type of object.
AttributeFile: Attribute filename.
ObjectType: The type of object to load attributes for.
Returns: Returns true if attributes are loaded correctly. Returns false if attribute file loading failed.